## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_record.hlab-pbx will be updated in-place
  ~ resource "cloudflare_record" "hlab-pbx" {
      ~ allow_overwrite = true -> false
        id              = "847c9b71ea6a131588d6b2fefcfcf3e5"
        name            = "hlab-pbx"
        tags            = []
        # (11 unchanged attributes hidden)
    }

  # cloudflare_record.hlab-sbc01 will be created
  + resource "cloudflare_record" "hlab-sbc01" {
      + allow_overwrite = false
      + comment         = "CREATED BY TF: Libre SBC LAB 01"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "sbc01.hlab"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "192.168.1.102"
      + zone_id         = "b7c587badd733e8efeef4febe696ca49"
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>